"ok" = "Ok";
"identifyReason" = "Identificazione";
"done" = "Fatto";
"code" = "codice";

// ERRORS
"alertTitleError" = "ERROR";
"alertMessage000" = "Si è verificato un errore";
"alertMessage001" = "La chiave digitale deve essere alfanumerica, contenere una lettera maiuscola e una minuscola e un numero di lunghezza compresa tra 8 e 24 caratteri";

// PSD2 ERROR
"PSD2ErrorDataTitle" = "I dati inseriti non sono corretti";
"PSD2ErrorDataMessage1" = "Si è verificato un errore. Avete ";
"PSD2ErrorDataMessage2" = " tentativi";

// BIOMETRIC ALERT
"titleBiometricAccessAlert" = "Accesso biometrico";
"messageBiometricAccessAlert" = "Vuoi usare la tua impronta digitale o Face ID per operare?";
"okButtonBiometricAccess" = "YES, USE";
"koButtonBiometricAccess"  = "NO, GRAZIE";

// PENDING PURCHASE
"titlePendingPurchase" = "Inserisci il codice che ti abbiamo appena inviato";
"acceptButtonPendingPurchase" = "ACCEPT";
"rejectButtonPendingPurchase" = "CANCEL";

// INSERT DIGITAL KEY
"hintDigitalKey" = "DigitalKey"; "hintDigitalKey" = "digitalKey";
"titleDigitalKey" = "Chiave digitale";
"subTitleDigitalKey" = "We need you to enter your digital key"; "subTitleDigitalKey" = "We need you to enter your digital key";
"acceptButtonDigitalKey" = "ACCEPT";

// PSD2 VALIDATE
"titleIntroValidate" = "Azione richiesta";
"subtitleIntroValidate" = "Per rispettare la direttiva sui servizi di pagamento 2 (PSD2), che mira a migliorare la sicurezza, dobbiamo richiedere la tua chiave digitale ogni 90 giorni per mostrarti informazioni relative alla tua carta.";
"acceptButtonIntroValidate" = "ENTER PASSWORD";

"titleOtpViewValidate" = "Codice";
"subtitleOtpViewValidate" = "Prima di inserire la tua chiave digitale, abbiamo bisogno che tu inserisca il codice che ti abbiamo appena inviato";
"resendButtonOtpViewValidate" = "Resend";
"acceptButtonOtpViewValidate" = "ACCEPT";

"forgotKeyButtonDigitalKeyViewValidate" = "Ho dimenticato la mia chiave digitale";

// Modulo enum
"btn_accept" = "ACCETTO";
"btn_create_key" = "CREA CHIAVE";
"btn_next" = "AVANTI";
"btn_resend" = "Invia nuovamente SMS";
"btn_enter_key" = "INVIO CHIAVE";
"msg_cancel_process" = "Operazione annullata";
"msg_failure" = "Operazione non riuscita";
"msg_error" = "ERRORE";
"msg_otp_resend" = "Codice reinviato";
"msg_otp_wrong" = "Il codice non è corretto";
"msg_remaining" = "Si è verificato un errore.\nTi rimangono @% tentativi";
"msg_sms_resend" = "SMS con codice reinviato";
"msg_success" = "Operazione riuscita";
"msg_server_error" = "È stato rilevato un errore imprevisto sui nostri server, riprova più tardi.";
"msg_try" = "Riprova o contatta il nostro servizio clienti";
"msg_warning" = "Avviso";
"fill_pwd_repeat" = "Devi definire la chiave digitale e ripeterla";
"fill_digital_key" = "Devi compilare la chiave digitale";
"fill_digital_key_invalid" = "Chiave digitale non valida";
"fill_digital_key_equals" = "Le chiavi digitali devono corrispondere";
"fill_digital_key_repeat" = "Devi definire la chiave digitale e ripeterla";

// CREA PSD2
"psd2_code_subtitle" = "Inserisci il codice che ti abbiamo appena inviato";
"psd2_digital_key_setup" = "Per completare la configurazione del tuo account abbiamo bisogno che tu crei la tua chiave digitale.";
"psd2_mandatory_sca" = "La Direttiva sui servizi di pagamento 2 (PSD2) mira a migliorare la sicurezza e ridurre le frodi attraverso l'autenticazione forte del cliente (SCA).\nLa chiave digitale è obbligatoria per le operazioni con carta e il mobile banking.";
"psd2_digital_key_about" = "Informazioni sulla chiave digitale";
"psd2_digital_key_create" = "La tua chiave digitale verrà richiesta nelle operazioni con le carte e in alcune operazioni con le app.\n\nSe non ricordi la tua chiave digitale, puoi crearla di nuovo qui.";
"psd2_code_receive" = "Inserisci il codice che \nti abbiamo appena inviato";
"psd2_code_new" = "Inserisci la tua nuova password\ndigital";
"psd2_code_repeat" = "Ripeti la tua nuova chiave digitale";
"psd2_digital_key_new" = "Nuova chiave digitale";
"psd2_digital_key_change_failure" = "La tua chiave digitale non è stata modificata correttamente";
"psd2_digital_key_change_success" = "Chiave digitale modificata con successo";
"psd2_mandatory" = "Per ottemperare alla Direttiva sui servizi di pagamento 2 (PSD2,\nche mira a migliorare la sicurezza,\ndobbiamo richiedere la tua chiave digitale ogni 90 giorni per mostrarti le informazioni relative alla tua carta.";
"psd2_mandatory_personal" = "La chiave digitale è personale e non sarà mai richiesta attraverso nessun canale (SMS, eMail o altro,\nné dal nostro servizio clienti.\nSarà richiesta solo quando operi con la tua carta e per consultare i loro movimenti in l'applicazione.";
"psd2_phone" = "Ora inserisci il tuo numero di cellulare";
"psd2_phone_check" = "Per verificare la tua identità, inserisci il tuo cellulare";
"psd2_phone_number" = "Numero di telefono";

// MODIFICA PSD2
"psd2_required" = "Azione richiesta";
"psd2_digital_key_generate" = "La chiave digitale sarà richiesta nelle operazioni con la carta e in alcune operazioni bancarie elettroniche. \n\nSe non ricordi il tuo numero segreto, puoi generarne uno nuovo qui.";
"psd2_code_insert" = "Inserisci codice";
"psd2_insert_code" = "Prima di inserire la tua chiave digitale abbiamo bisogno che tu inserisca il codice che ti abbiamo appena inviato";
"psd2_digital_key_ok" = "La tua chiave digitale è stata creata correttamente";
"psd2_digital_key" = "Chiave digitale";
"psd2_digital_key_repeat" = "Ripeti tasto digitale";
"psd2_pwd_restrictions" = "Deve essere compreso tra 8 e 24 caratteri, uno maiuscolo, uno minuscolo e un numero";
"psd2_secret_code_match" = "I codici segreti devono corrispondere";
"psd2_secret_code_wrong" = "I dati inseriti non sono corretti";

// PSD2 Modifica telefono
"msg_change_phone" = "Aggiorna cellulare";
"msg_cp_success" = "Mobile aggiornato correttamente";
"msg_cp_success_s" = "Abbiamo salvato il tuo nuovo numero di cellulare, d'ora in poi riceverai notifiche su questo numero";
"title_change_phone" = "Qual è il tuo nuovo numero di cellulare?";
"title_change_phone_s" = "È importante che sia aggiornato in modo da poter operare normalmente";
